Repository: Broivula/Headlight
Catalog: Headlight/*.lproj/Localizable.strings
Languages: fi

# err_name_creation_title
source: Error
fi: Virhe

# err_name_creation
source: Please enter a name between 1-20 characters.
fi: Käyttäjänimen tulee olla 1-20 merkkiä pitkä.

# get_started
source: Hello! Let's get started by entering your username.
fi: Moi! Aloitetaan syöttämällä käyttäjänimesi.

# skill_pick
source: Great! Now let's fill out your existing skills. Pick the skills from the list down below ðŸ‘‡
fi: Hienoa! Nyt täytetään sinun taitosi. Valitse ne alla olevasta listasta 👇

# name_placeholder_text
source: Username
fi: Käyttäjänimi

# enter_button_text
source: Enter
fi: Syötä

# next_button
source: Next
fi: Seuraava

source: skills chosen
fi: taitoa valittu

source: skill chosen
fi: taito valittu

source: courses
fi: kurssia

source: Front-End Developer
fi: Front-End Kehittäjä

source: Back-End Developer
fi: Back-End Kehittäjä

source: Full Stack Developer
fi: Full Stack Kehittäjä

source: Computer Scientist
fi: Tietotekniikan tutkija

source: UI Designer
fi: UI Suunnittelija

source: Android Developer
fi: Android Kehittäjä

source: iOS Developer
fi: iOS Kehittäjä

source: Mobile Developer
fi: Mobiilikehittäjä

source: Game Developer
fi: Pelikehittäjä

source: Description
fi: Kuvaus

source: Organized by:
fi: Järjestäjä:

source: Starts:
fi: Alkaa:

source: Ends:
fi: Loppuu:

source: Requires
fi: Vaaditut

source: Provides
fi: Saadut

# searchbar_placeholder
source: Search for a course
fi: Hae kurssia

# cancel_btn
source: Cancel
fi: Peruuta

source: Overview
fi: Yleiskatsaus

source: Search
fi: Haku

source: Ongoing course
fi: Nykyinen kurssi

source: Courses left:
fi: Kursseja jäljellä:

source: Courses completed:
fi: Suoritetut kurssit:

# tier-1-physics
source: Basics of Physics
fi: Fysiikan perusteet

# tier-2-physics
source: Advanced Physics
fi: Edistynyt fysiikka

# tier-3-physics
source: Additional Advanced Physics
fi: Korkeampi fysiikka

# tier-1-mathematics
source: Basic Mathematics
fi: Matematiikan perusteet

# tier-2-mathematics
source: Advanced Mathematics
fi: Edistynyt matematiikka

# tier-3-mathematics
source: Additional Advanced Mathematics
fi: Korkeampi matematiikka

# basic-unix
source: UNIX Basics
fi: UNIX perusteet

# basic-logism
source: Basics of logism
fi: Logismin perusteet

# basic-logisim
source: Basics of logism
fi: Logismin perusteet

# advanced-logisim
source: Advanced logism
fi: Edistynyt logismi

source: UX Prototyping
fi: UX Prototyypit

source: Color theory
fi: Väriteoria

source: Object-oriented programming
fi: Olio-ohjelmointi

source: Data Communications
fi: Tietoliikenne

# pwa
source: Progressive Web Applications
fi: Progressiiviset web-sovellukset

# metropolia-web-01_name
source: Web Basics
fi: Web-teknologioiden perusteet

# metropolia-web-01_description
source: Learn basics of web
fi: Opi web-teknologioiden perusteet

# metropolia-physics-01_name
source: Physics 01
fi: Fysiikka 01

# metropolia-physics-01_description
source: The introduction course to physics
fi: Fysiikan alkeet

# metropolia-physics-02_name
source: Physics 02
fi: Fysiikka 02

# metropolia-physics-02_description
source: Deep dive into the world of electromagnetism
fi: Syväsukellus sähkömagnetismin maailmaan

# metropolia-physics-03_name
source: Physics 03
fi: Fysiikka 03

# metropolia-physics-03_description
source: Kinetic motion and thermodynamics
fi: Liike-energia ja termodynamiikka

# metropolia-maths-01_name
source: Mathematics 01
fi: Matematiikka 01

# metropolia-maths-01_description
source: The introduction course mathematics = basic calculus
fi: Matematiikan alkeiskurssi

# metropolia-maths-02_name
source: Mathematics 02
fi: Matematiikka 02

# metropolia-maths-02_description
source: Intermediate calculus
fi: Keskitason laskentaa

# metropolia-maths-03_name
source: Mathematics 03
fi: Matematiikka 03

# metropolia-maths-03_description
source: Advanced calculus
fi: Edistynyttä laskentaa

# metropolia-smart-systems-01_name
source: Smart Systems 01
fi: Sulautetut järjestelmät 01

# metropolia-smart-systems-01_description
source: First course of smart systems technology = mechanics of computer chips
fi: Sulautettujen järjestelmien alkeiskurssi. Kurssilla tutustutaan sirujen toimintaan.

# metropolia-smart-systems-02_name
source: Smart Systems 02
fi: Sulautetut järjestelmät 02

# metropolia-smart-systems-02_description
source: How to create automated systems = turing machine principles
fi: Miten automatisoituja järjestelmiä kehitetään: Turingin koneen perusteet

# metropolia-mobile-01_name
source: Web Based Mobile Applications
fi: Web-pohjaiset mobiilisovellukset

# metropolia-mobile-01_description
source: Creating mobile applications with web technologies.
fi: Mobiilisovellusten luominen web-teknologioiden avulla.

# metropolia-mobile-02_name
source: Object-Oriented Programming and Datacommunication
fi: Olio-ohjelmointi ja tietoliikenne

# metropolia-mobile-02_description
source: Learning the basics of how the internet works & object oriented programming with Java.
fi: Internetin toiminnan perusteet ja olio-ohjelmionti Javalla.

# metropolia-mobile-03_name
source: Mobile Application Development (Android)
fi: Mobiilisovellusten kehitys (Android)

# metropolia-mobile-03_description
source: Creating native applications for Android.
fi: Kurssilla opitaan luomaan natiivisovelluksia Android-alustalle.

# metropolia-mobile-04_name
source: Mobile Application Development (iOS)
fi: Mobiilisovellusten kehitys (iOS)

# metropolia-mobile-04_description
source: Creating native applications for iOS.
fi: Kurssilla opitaan luomaan natiivisovelluksia iOS-alustalle.

# metropolia-mobile-05_name
source: Converting websites to PWA
fi: Nettisivujen muuntaminen PWA:ksi

# metropolia-mobile-05_description
source: Converting existing websites to mobile friendly PWAs.
fi: Kurssilla opitaan muuntamaan jo olemassa olevia nettisivuja mobiiliystävällisiksi PWA-sivustoiksi.

# metropolia-sql-01_name
source: Basics of SQL
fi: SQL perusteet

# metropolia-sql-01_description
source: Learn to query a database with SQL
fi: Opi etsimään tietokannoista SQL:n avulla.

# metropolia-game-development-01_name
source: Unity Basics
fi: Unityn perusteet

# metropolia-game-development-01_description
source: Learn the basics of Unity and C#
fi: Opi Unityn ja C#:n perusteet

# helsingin-yliopisto-java-basics-01_name
source: The basics of programming
fi: Ohjelmoinnin perusteet

# helsingin-yliopisto-java-basics-01_description
source: In this course you will learn about algorithms = object oriented programming and the basics of Java
fi: Tällä kurssilla opit algoritmeistä ja olio-ohjelmoinnista Javalla.

# vaasan-yliopisto-java-basics-01_name
source: The basics of programming
fi: Ohjelmoinnin perusteet

# vaasan-yliopisto-java-basics-01_description
source: In this course you will learn to design and create basic programs in Java
fi: Tällä kurssilla opit kehittämään yksinkertaisia Java-sovelluksia.

# metropolia-game-development-02_name
source: Basics of Unreal
fi: Unreal Enginen perusteet

# metropolia-game-development-02_description
source: Learn the basics of Unreal and c++
fi: Opi C++ ja Unreal Enginen perusteet

# aaltoyliopisto-c++-01_name
source: C++ Programming
fi: C++ ohjelmointi

# aaltoyliopisto-c++-01_description
source: In this course you will get familiar with C++ by designing a whole program from scratch that utilises different C++ features
fi: Tällä kurssilla tulet tutustumaan C++:aan ja luomaan kokonaisen ohjelman, joka käyttää hyväksi monia C++:n ominaisuuksia.
